---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveByPoints
source: html/98f18d22-b5bf-9b63-e335-8e38c4face7b.htm
---
# CurveByPoints Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.